//-----------------------------------------------------------------------------//
// インポート || import
//-----------------------------------------------------------------------------//
import { DirectionalLight, Scene } from "three";

//-----------------------------------------------------------------------------//
// 定数 || constant
//-----------------------------------------------------------------------------//
const LIGHT_COLOR : number = 0xffffff;
const LIGHT_STRENGTH : number = 1;

//-----------------------------------------------------------------------------//
//  平行光源を管理するクラス
//  クラス名　　：  DirectionalLightManager
//  引数　　　　：  width: キャンバスの横幅
//　　　　　　　　  height: キャンバスの縦幅
//-----------------------------------------------------------------------------//
export default class DirectionalLightManager{

    //-----------------------------------------------------------------------------//
    // フィールド || field
    //-----------------------------------------------------------------------------//
    private directionalLight: DirectionalLight;

    //-----------------------------------------------------------------------------//
    // コンストラクタ || constructor
    //-----------------------------------------------------------------------------//
    public constructor(scene: Scene){
        // フィールドにインスタンスを作成する
        this.directionalLight = new DirectionalLight(LIGHT_COLOR, LIGHT_STRENGTH);
    
        // シーンに追加する
        scene.add(this.directionalLight);
    }

    //-----------------------------------------------------------------------------//
    // メソッド || method
    //-----------------------------------------------------------------------------//
    
    // 終了処理
    public terminate(){
        this.directionalLight.dispose();
    }
}